hmmm3012/OTA-ESP32-STM32/main/src/file_server.c
// C library
#include <stdio.h>
#include <string.h>
#include <sys/param.h>
#include <sys/unistd.h>
#include <sys/stat.h>
#include <dirent.h>
#include "stdbool.h"
// LOGGING
#include "esp_err.h"
#include "esp_log.h"
// SPIFFS
#include "esp_vfs.h"
#include "esp_spiffs.h"
// HTTP server
#include "app.h"
#include "esp_http_server.h"
// OTA
#include "driver/uart.h"
#include "stm32ota.h"
#include "GPIO_OTA.h"
#include "STA_AP.h"

/* Max length a file path can have on storage */
#define FILE_PATH_MAX (ESP_VFS_PATH_MAX + CONFIG_SPIFFS_OBJ_NAME_LEN)
/* Max size of an individual file. Make sure this
 * value is same as that set in upload_script.html */
#define MAX_FILE_SIZE (200 * 1024) // 200 KB
#define MAX_FILE_SIZE_STR "200KB"
#define IS_FILE_EXT(filename, ext) \
    (strcasecmp(&filename[strlen(filename) - sizeof(ext) + 1], ext) == 0)
/*Web page binary*/
extern const unsigned char favicon_ico_start[] asm("_binary_favicon_ico_start");
extern const unsigned char favicon_ico_end[] asm("_binary_favicon_ico_end");
extern const unsigned char ota_start[] asm("_binary_ota_html_start");
extern const unsigned char ota_end[] asm("_binary_ota_html_end");
extern const unsigned char style_start[] asm("_binary_style_css_start");
extern const unsigned char style_end[] asm("_binary_style_css_end");
extern const unsigned char wifimanager_start[] asm("_binary_wifimanager_html_start");
extern const unsigned char wifimanager_end[] asm("_binary_wifimanager_html_end");
extern const unsigned char about_start[] asm("_binary_about_html_start");
extern const unsigned char about_end[] asm("_binary_about_html_end");
extern const unsigned char list_start[] asm("_binary_list_html_start");
extern const unsigned char list_end[] asm("_binary_list_html_end");
System_DataTypedef *system_data_FS = NULL;

#if DEBUG
static const char *TAG = "file_server";
#endif

// Handler by me
static esp_err_t cfgWifi_handler(httpd_req_t *req);
static esp_err_t scan_handler(httpd_req_t *req);
static esp_err_t reload_json(httpd_req_t *req);
static esp_err_t wifi_manager_handler(httpd_req_t *req);
static esp_err_t style_handler(httpd_req_t *req);
static esp_err_t ota_manager_handler(httpd_req_t *req);
static esp_err_t about_handler(httpd_req_t *req);
static esp_err_t favicon_get_handler(httpd_req_t *req);
static esp_err_t download_mcu_handler(httpd_req_t *req);
static esp_err_t http_resp_dir_html(httpd_req_t *req);
static const char *get_path_from_uri(char *dest, const char *base_path, const char *uri, size_t destsize);
static esp_err_t upload_post_handler(httpd_req_t *req);
static esp_err_t delete_post_handler(httpd_req_t *req);
static esp_err_t changeMode_handler(httpd_req_t *req);
/* Function to start the file server */
esp_err_t start_file_server(System_DataTypedef *Para_system_data)
{
    system_data_FS = Para_system_data;
    RunBoth();
    Get_SSID(system_data_FS->ssid);
    Get_IP(system_data_FS->ip);
    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    // SET max URI server can handle
    config.max_uri_handlers = 13;

    /* Use the URI wildcard matching function in order to
     * allow the same handler to respond to multiple different
     * target URIs which match the wildcard scheme */
    config.uri_match_fn = httpd_uri_match_wildcard;

#if DEBUG
    ESP_LOGI(TAG, "Starting HTTP Server on port: '%d'", config.server_port);
#endif

    if (httpd_start(&server, &config) != ESP_OK)
    {
#if DEBUG
        ESP_LOGE(TAG, "Failed to start file server!");
#endif
        return ESP_FAIL;
    }

    /* URI handler for CSS request */
    httpd_uri_t style_get = {
        .uri = "/style.css",
        .method = HTTP_GET,
        .handler = style_handler,
        .user_ctx = NULL,
    };
    /* URI handler for FAV icon request */
    httpd_uri_t favicon_handle = {
        .uri = "/favicon.ico",
        .method = HTTP_GET,
        .handler = favicon_get_handler,
        .user_ctx = NULL,
    };
    /* URI handler for download program to MCU */
    httpd_uri_t file_download = {
        .uri = "/download*",
        .method = HTTP_GET,
        .handler = download_mcu_handler,
        .user_ctx = NULL,
    };
    /* URI handler for uploading files to server */
    httpd_uri_t file_upload = {
        .uri = "/upload/*",
        .method = HTTP_POST,
        .handler = upload_post_handler,
        .user_ctx = NULL,
    };

    /* URI handler for deleting files from server */
    httpd_uri_t file_delete = {
        .uri = "/delete/*",
        .method = HTTP_POST,
        .handler = delete_post_handler,
        .user_ctx = NULL,
    };
    /* URI handler for Wifi Manager page request */
    httpd_uri_t wifi_manager = {
        .uri = "/*",
        .method = HTTP_GET,
        .handler = wifi_manager_handler,
        .user_ctx = NULL, // Pass server data as context
    };

    /* URI handler for About page request */
    httpd_uri_t about_page = {
        .uri = "/about",
        .method = HTTP_GET,
        .handler = about_handler,
        .user_ctx = NULL // Pass server data as context
    };

    /* URI handler for OTA request */
    httpd_uri_t ota_manager = {
        .uri = "/ota*",
        .method = HTTP_GET,
        .handler = ota_manager_handler,
        .user_ctx = NULL, // Pass server data as context
    };

    /* URI handler for list file request */
    httpd_uri_t list_file = {
        .uri = "/list",
        .method = HTTP_GET,
        .handler = http_resp_dir_html,
        .user_ctx = NULL // Pass server data as context
    };

    /* URI handler for scan wifi request */
    httpd_uri_t scan_handle = {
        .uri = "/scan",
        .method = HTTP_GET,
        .handler = scan_handler,
        .user_ctx = NULL // Pass server data as context
    };
    httpd_uri_t cfgWifi_handle = {
        .uri = "/cfgwifi",
        .method = HTTP_POST,
        .handler = cfgWifi_handler,
        .user_ctx = NULL, // Pass server data as context
    };
    httpd_uri_t changeMode_handle = {
        .uri = "/mode",
        .method = HTTP_GET,
        .handler = changeMode_handler,
        .user_ctx = NULL, // Pass server data as context
    };
    // Register URI handler
    httpd_register_uri_handler(server, &file_download);
    httpd_register_uri_handler(server, &file_upload);
    httpd_register_uri_handler(server, &file_delete);
    httpd_register_uri_handler(server, &ota_manager);
    httpd_register_uri_handler(server, &about_page);
    httpd_register_uri_handler(server, &style_get);
    httpd_register_uri_handler(server, &list_file);
    httpd_register_uri_handler(server, &favicon_handle);
    httpd_register_uri_handler(server, &scan_handle);
    httpd_register_uri_handler(server, &cfgWifi_handle);
    httpd_register_uri_handler(server, &changeMode_handle);
    httpd_register_uri_handler(server, &wifi_manager);

    return ESP_OK;
}

// function definition
static esp_err_t changeMode_handler(httpd_req_t *req)
{
    // Change state Boot -> Debug or Debug -> Boot
    uint8_t *f_oled = system_data_FS->sys_state;
    uint8_t parity = UART_PARITY_EVEN;
    if (*f_oled == 3)
    {
        parity = UART_PARITY_DISABLE;
        *f_oled = 2;
    }
    else
    {
        *f_oled = 3;
    }
    if (uart_set_parity(UART, parity) == ESP_OK)
    {
        httpd_resp_sendstr(req, "Change mode done");
    }
    else
    {
        httpd_resp_send_500(req);
    }
    return ESP_OK;
}
static esp_err_t cfgWifi_handler(httpd_req_t *req)
{
    char *buf = malloc(req->content_len);
    char *ssid = malloc(req->content_len);
    char *pass = malloc(req->content_len);
    httpd_req_recv(req, buf, req->content_len);
#if DEBUG
    ESP_LOGI(TAG, "%s", buf);
#endif
    int i, j;
    for (i = 5, j = 0; i < req->content_len; j++, i++)
    {
        if (buf[i] == '&')
            break;
        if (buf[i] == '+')
            ssid[j] = ' ';
        else
            ssid[j] = buf[i];
    }
    ssid[j] = '\0';
    for (i += 6, j = 0; i < req->content_len; j++, i++)
    {
        pass[j] = buf[i];
    }
    pass[j] = '\0';
    if (Connect_New_Wifi(ssid, pass))
    {
        httpd_resp_sendstr(req, "success");
    }
    else
    {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Wrong ssid or password or some unexpected events");
    }
    Get_SSID(system_data_FS->ssid);
    Get_IP(system_data_FS->ip);
    system_data_FS->sys_state |= (MODE_BOOT | MODE_CHANGE);
    // Get_SSID(((System_DataTypedef *)req->user_ctx)->ssid);
    // Get_IP(((System_DataTypedef *)req->user_ctx)->ip);
    // ((System_DataTypedef *)req->user_ctx)->sys_state = 3;
    free(buf);
    free(ssid);
    free(pass);
    return ESP_OK;
}
static esp_err_t scan_handler(httpd_req_t *req)
{
    char str[500] = "";
    Scan_Wifi(str);
    httpd_resp_sendstr(req, str);
    return ESP_OK;
}
static esp_err_t reload_json(httpd_req_t *req)
{
    // size_t *total = &((System_DataTypedef *)req->user_ctx)->total;
    // size_t *used = &((System_DataTypedef *)req->user_ctx)->used;
    // bool STATE1 = ((System_DataTypedef *)req->user_ctx)->STATE1;
    // bool STATE2 = ((System_DataTypedef *)req->user_ctx)->STATE2;
    size_t *total = &system_data_FS->total;
    size_t *used = &system_data_FS->used;
    bool STATE1 = system_data_FS->STATE1;
    bool STATE2 = system_data_FS->STATE2;
    esp_err_t ret = esp_spiffs_info(NULL, total, used);
    if (ret != ESP_OK)
    {
#if DEBUG
        ESP_LOGE("SPIFFS", "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
#endif
    }
    char buf[260];
    char str[1000] = "{\"spiStorage\":";
#if DEBUG
    ESP_LOGI(TAG, "GET SPI INFO DONE");
#endif
    sprintf(str, "{\"spistorage\":\"%d\",\"spiused\":\"%d\",\"state1\":\"%s\",\"state2\":\"%s\",\"files\":[", *total, *used, STATE1 == 1 ? "running" : "off", STATE2 == 1 ? "running" : "off");
    const char *dirpath = "/data/";
    char entrypath[FILE_PATH_MAX];
    char entrysize[16];
    const char *entrytype;
    struct dirent *entry;
    struct stat entry_stat;
    DIR *dir = opendir(dirpath);
    const size_t dirpath_len = strlen(dirpath);
    strlcpy(entrypath, dirpath, sizeof(entrypath));
    while ((entry = readdir(dir)) != NULL)
    {
        entrytype = (entry->d_type == DT_DIR ? "directory" : "file");
        strlcpy(entrypath + dirpath_len, entry->d_name, sizeof(entrypath) - dirpath_len);
        if (stat(entrypath, &entry_stat) == -1)
        {
#if DEBUG
            ESP_LOGE(TAG, "Failed to stat %s : %s", entrytype, entry->d_name);
#endif
            continue;
        }
        sprintf(entrysize, "%ld", entry_stat.st_size);
#if DEBUG
        ESP_LOGI(TAG, "Found %s : %s (%s bytes)", entrytype, entry->d_name, entrysize);
#endif
        sprintf(buf, "\"%s\",", entry->d_name);
        strcat(str, buf);
    }
    closedir(dir);
    strcat(str, "\"\"]}");
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_sendstr(req, str);
    return ESP_OK;
}
static esp_err_t download_mcu_handler(httpd_req_t *req)
{
    // #if DEBUG
    //     ESP_LOGI("MODE", "%d", system_data_FS->sys_state);
    // #endif
    if ((system_data_FS->sys_state & 0b1) == 1)
    {
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_sendstr(req, "WRONG MODE");
    }
    else
    {
        struct stat entry_stat;
        char filepath[FILE_PATH_MAX];
        int lastbuf = 0, bini = 0;
        uint8_t binw[256];
        /* Retrieve the base path of file storage to con  the full path */
        const char *filename = get_path_from_uri(filepath, system_data_FS->base_path,
                                                 req->uri + sizeof("/download/") - 1, sizeof(filepath));
        stat(filepath, &entry_stat);
        bini = entry_stat.st_size / 256;
        lastbuf = entry_stat.st_size % 256;
#if DEBUG
        ESP_LOGI(TAG, "%ld", entry_stat.st_size);
        ESP_LOGI(TAG, "%s", filename);
        ESP_LOGI(TAG, "%s", filepath);
        ESP_LOGI(TAG, "num buf : %d", bini);
#endif
        if (req->uri[9] == '2')
        {
            Boot2();
        }
        else
        {
            Boot1();
        }
        if (initSTM32())
        {
            FILE *fd = fopen(filepath, "r");
            if (fd)
            {
                for (int i = 0; i < bini; i++)
                {
                    fread(binw, 1, 256, fd);
                    stm32SendCommand(STM32WR);
                    if (stm32Address(STM32STADDR + (256 * i)))
                    {
#if DEBUG
                        if (stm32SendData(binw, 255))
                            ESP_LOGI(TAG, "data send success: %d", i);
                        else
                        {
                            ESP_LOGI(TAG, "data send failed : %d", i);
                        }
#else
                        stm32SendData(binw, 255);
                        // httpd_resp_send_500(req);
#endif
                    }
                    else
                    {
#if DEBUG
                        ESP_LOGI(TAG, "send address failed");
#endif
                        httpd_resp_send_500(req);
                    }
                }
                fread(binw, 1, lastbuf, fd);
                stm32SendCommand(STM32WR);
                if (stm32Address(STM32STADDR + (256 * bini)))
                {
#if DEBUG
                    if (stm32SendData(binw, lastbuf))
                        ESP_LOGI(TAG, "last buf send success");
                    else
                    {
                        ESP_LOGI(TAG, "last buf send failed");
                        httpd_resp_send_500(req);
                    }
#else
                    stm32SendData(binw, lastbuf);
                    // httpd_resp_send_500(req);
#endif
                }
                else
                {
#if DEBUG
                    ESP_LOGI(TAG, "send address for last failed");
#endif
                    httpd_resp_send_500(req);
                }
                fclose(fd);
            }
            else
            {
#if DEBUG
                ESP_LOGI(TAG, "file not found");
#endif
                httpd_resp_send_500(req);
            }
        }
        else
        {
#if DEBUG
            ESP_LOGI(TAG, "init stm32 failed");
#endif
            httpd_resp_send_500(req);
        }
        httpd_resp_sendstr(req, "Download done");
    }
    return ESP_OK;
}
static esp_err_t wifi_manager_handler(httpd_req_t *req)
{
    if (strcmp(req->uri, "/") == 0)
    {
        const size_t wifi_manager_size = (wifimanager_end - wifimanager_start);
        httpd_resp_set_type(req, "text/html");
        httpd_resp_set_status(req, "200 OK");
        httpd_resp_send(req, (const char *)wifimanager_start, wifi_manager_size);
    }
    else if (strcmp(req->uri, "getIpSsid"))
    {
#if DEBUG
        ESP_LOGI(TAG, "Current SSID: %s", (system_data_FS->ssid));
        ESP_LOGI(TAG, "Current IP  : %s", (system_data_FS->ip));
#endif
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_sendstr_chunk(req, system_data_FS->ssid);
        httpd_resp_sendstr_chunk(req, "?");
        httpd_resp_sendstr_chunk(req, system_data_FS->ip);
        httpd_resp_sendstr_chunk(req, NULL);
    }
    else
    {
        httpd_resp_send_404(req);
    }
    return ESP_OK;
}
static esp_err_t style_handler(httpd_req_t *req)
{
    const size_t style_size = (style_end - style_start);
    httpd_resp_set_type(req, "text/css");
    httpd_resp_set_status(req, "200 OK");
    httpd_resp_send(req, (const char *)style_start, style_size);
    return ESP_OK;
}
static esp_err_t ota_manager_handler(httpd_req_t *req)
{
    bool *STATE1 = &system_data_FS->STATE1;
    bool *STATE2 = &system_data_FS->STATE2;
    uint8_t *fscreen = &system_data_FS->sys_state;
    const char *para = strchr(req->uri, '?');
    if (para)
    {
#if DEBUG
        ESP_LOGI(TAG, "RCV URI: %s", para);
#endif
    }
    if (!para)
    {
        const size_t ota_size = (ota_end - ota_start);
        httpd_resp_set_type(req, "text/html");
        httpd_resp_set_status(req, "200 OK");
        httpd_resp_send(req, (const char *)ota_start, ota_size);
        return ESP_OK;
    }
    else if (!strcmp(para, "?reload"))
    {
        reload_json(req);
        return ESP_OK;
    }
    else
    {
#if DEBUG
        ESP_LOGI("MODE", "%d", system_data_FS->sys_state);
#endif
        httpd_resp_set_type(req, "text/plain");
        if (!strcmp(para, "?runboth"))
        {
            RunBoth();
            *STATE1 = 1;
            *STATE2 = 1;
            *fscreen = MODE_CHANGE;
            httpd_resp_sendstr(req, "RUN BOTH");
#if DEBUG
            ESP_LOGI(TAG, "RUN BOTH");
#endif
        }
        else if (!strcmp(para, "?run1"))
        {
            Run1();
            *STATE1 = 1;
            *STATE2 = 0;
            *fscreen = MODE_CHANGE;
            httpd_resp_sendstr(req, "RUN 1");
#if DEBUG
            ESP_LOGI(TAG, "Only RUN 1");
#endif
        }
        else if (!strcmp(para, "?run2"))
        {
            Run2();
            *STATE1 = 0;
            *STATE2 = 1;
            *fscreen = MODE_CHANGE;
            httpd_resp_sendstr(req, "RUN 2");
#if DEBUG
            ESP_LOGI(TAG, "Only RUN 2");
#endif
        }
        else // ERASE MCU
        {
            if ((system_data_FS->sys_state & 0b1) == 1)
            {
                httpd_resp_set_type(req, "text/plain");
                httpd_resp_sendstr(req, "WRONG MODE");
            }
            else
            {
                if (!strcmp(para, "?erase1"))
                {
                    Boot1();
                }
                else
                {
                    Boot2();
                }
#if DEBUG
                if (initSTM32() == 1)
                    ESP_LOGI(TAG, "INIT STM32 DONE");
                else
                    ESP_LOGI(TAG, "INIT STM32 FAILED");
#else
                initSTM32();
#endif

