hmmm3012/OTA-ESP32-STM32/main/src/file_server.c
                if (stm32Erase() == 1)
                {
                    httpd_resp_sendstr(req, "ERASE 1");
#if DEBUG
                    ESP_LOGI(TAG, "ERASE DONE");
#endif
                }
                else
                {
#if DEBUG
                    ESP_LOGI(TAG, "ERASE FAILED");
#endif
                    httpd_resp_send_500(req);
                }
            }
        }
    }
    return ESP_OK;
}
static esp_err_t about_handler(httpd_req_t *req)
{
    const size_t about_size = (about_end - about_start);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_status(req, "200 OK");
    httpd_resp_send(req, (const char *)about_start, about_size);
    return ESP_OK;
}
static esp_err_t favicon_get_handler(httpd_req_t *req)
{
    const size_t favicon_ico_size = (favicon_ico_end - favicon_ico_start);
    httpd_resp_set_type(req, "image/x-icon");
    httpd_resp_send(req, (const char *)favicon_ico_start, favicon_ico_size);
    return ESP_OK;
}
static esp_err_t http_resp_dir_html(httpd_req_t *req)
{
    const char *dirpath = "/data/";
    char entrypath[FILE_PATH_MAX];
    char entrysize[16];
    const char *entrytype;

    struct dirent *entry;
    struct stat entry_stat;

    DIR *dir = opendir(dirpath);
    const size_t dirpath_len = strlen(dirpath);

    /* Retrieve the base path of file storage to con  the full path */
    strlcpy(entrypath, dirpath, sizeof(entrypath));
#if DEBUG
    ESP_LOGI(TAG, "%s", entrypath);
#endif
    if (!dir)
    {
#if DEBUG
        ESP_LOGE(TAG, "Failed to stat dir : %s", dirpath);
#endif
        /* Respond with 404 Not Found */
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Directory does not exist");
        return ESP_FAIL;
    }
    const size_t list_size = (list_end - list_start);
    /* Add file upload form and script which on execution sends a POST request to /upload */
    httpd_resp_send_chunk(req, (const char *)list_start, list_size);

    /* Iterate over all files / folders and fetch their names and sizes */
    while ((entry = readdir(dir)) != NULL)
    {
        entrytype = (entry->d_type == DT_DIR ? "directory" : "file");

        strlcpy(entrypath + dirpath_len, entry->d_name, sizeof(entrypath) - dirpath_len);
#if DEBUG
        ESP_LOGI(TAG, "%s", entrypath);
#endif
        if (stat(entrypath, &entry_stat) == -1)
        {
#if DEBUG
            ESP_LOGE(TAG, "Failed to stat %s : %s", entrytype, entry->d_name);
#endif
            continue;
        }
        sprintf(entrysize, "%ld", entry_stat.st_size);
#if DEBUG
        ESP_LOGI(TAG, "Found %s : %s (%s bytes)", entrytype, entry->d_name, entrysize);
#endif
        /* Send chunk of HTML file containing table entries with file name and size */
        httpd_resp_sendstr_chunk(req, "<tr><td>");
        httpd_resp_sendstr_chunk(req, entry->d_name);
        httpd_resp_sendstr_chunk(req, "</td><td>");
        httpd_resp_sendstr_chunk(req, entrysize);
        httpd_resp_sendstr_chunk(req, "</td><td>");
        httpd_resp_sendstr_chunk(req, "</td><td>");
        httpd_resp_sendstr_chunk(req, "<form method=\"post\" action=\"/delete/");
        httpd_resp_sendstr_chunk(req, entry->d_name);
        httpd_resp_sendstr_chunk(req, "\"><input type=\"submit\" value =\"Delete\"></form>");
        httpd_resp_sendstr_chunk(req, "</td></tr>\n");
    }
    closedir(dir);

    /* Finish the file list table */
    httpd_resp_sendstr_chunk(req, "</tbody></table>");

    /* Send remaining chunk of HTML file to complete it */
    httpd_resp_sendstr_chunk(req, "</section></div></body></html>");

    /* Send empty chunk to signal HTTP response completion */
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}
static const char *get_path_from_uri(char *dest, const char *base_path, const char *uri, size_t destsize)
{
    const size_t base_pathlen = strlen(base_path);
    size_t pathlen = strlen(uri);

    const char *quest = strchr(uri, '?');
    if (quest)
    {
        pathlen = MIN(pathlen, quest - uri);
    }
    const char *hash = strchr(uri, '#');
    if (hash)
    {
        pathlen = MIN(pathlen, hash - uri);
    }

    if (base_pathlen + pathlen + 1 > destsize)
    {
        /* Full path string won't fit into destination buffer */
        return NULL;
    }
    /* Con  full path (base + path) */
    strcpy(dest, base_path);
    strlcpy(dest + base_pathlen, uri, pathlen + 1);
    /* Return pointer to path, skipping the base */
    return dest + base_pathlen;
}
static esp_err_t upload_post_handler(httpd_req_t *req)
{
    char filepath[FILE_PATH_MAX];
    FILE *fd = NULL;
    struct stat file_stat;

    /* Skip leading "/upload" from URI to get filename */
    /* Note sizeof() counts NULL termination hence the -1 */
    const char *filename = get_path_from_uri(filepath, system_data_FS->base_path,
                                             req->uri + sizeof("/upload") - 1, sizeof(filepath));
#if DEBUG
    ESP_LOGI(TAG, "file name: %s", filename);
    ESP_LOGI(TAG, "file path: %s", filepath);
#endif
    if (!filename)
    {
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    /* Filename cannot have a trailing '/' */
    if (filename[strlen(filename) - 1] == '/')
    {
#if DEBUG
        ESP_LOGE(TAG, "Invalid filename : %s", filename);
#endif
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid filename");
        return ESP_FAIL;
    }

    if (stat(filepath, &file_stat) == 0)
    {
#if DEBUG
        ESP_LOGE(TAG, "File already exists : %s", filepath);
#endif
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File already exists");
        return ESP_FAIL;
    }

    /* File cannot be larger than a limit */
    if (req->content_len > MAX_FILE_SIZE)
    {
#if DEBUG
        ESP_LOGE(TAG, "File too large : %d bytes", req->content_len);
#endif
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST,
                            "File size must be less than " MAX_FILE_SIZE_STR "!");
        /* Return failure to close underlying connection else the
         * incoming file content will keep the socket busy */
        return ESP_FAIL;
    }

    fd = fopen(filepath, "w");
    if (!fd)
    {
#if DEBUG
        ESP_LOGE(TAG, "Failed to create file : %s", filepath);
#endif
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to create file");
        return ESP_FAIL;
    }
#if DEBUG
    ESP_LOGI(TAG, "Receiving file : %s...", filename);
#endif
    /* Retrieve the pointer to scratch buffer for temporary storage */
    // char *buf = ((System_DataTypedef *)req->user_ctx)->scratch;
    char *buf = system_data_FS->scratch;
    int received;

    /* Content length of the request gives
     * the size of the file being uploaded */
    int remaining = req->content_len;

